#include <iostream>

int main()
{
    double x = 0;
    std::cout << "Придумай число.\nЗробив?(тисни ентер)";
    std::cin.get();
    std::cout << "Помнож задане число на 10.\nЗробив?(тисни ентер)";
    std::cin.get();
    std::cout << "Поділи отримане число на 2.\nЗробив?(тисни ентер)";
    std::cin.get();
    std::cout << "Додай до отриманого числа своє задумане.\nЗробив?(тисни ентер)";
    std::cin.get();
    std::cout << "Поділи отримане числа на 3.\nЗробив?(тисни ентер)";
    std::cin.get();
    std::cout << "Що вийшло?= ";
    std::cin >> x;

    x += 4;
    x /= 2;
    x -= 2;

    std::cout << "Ваше число: " << x << "!\n";

    return 0;
}